Autodesk.Revit.DB.TriangulatedSolidOrShell.GetShellComponent(System.Int32)
Returns the specified shell component of a solid or shell. Input componentIndex must lie
between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent
should not be modified by the caller.
componentIndex:
The component index, must be between 0 and ShellComponentCount – 1, inclusive.
Returns:
The component.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Shell component index componentIndex is out of range.
Since:
2013

Autodesk.Revit.DB.TriangulatedSolidOrShell.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TriangulatedSolidOrShell.ShellComponentCount
The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
Since:
2013

Autodesk.Revit.DB.TriangulatedSolidOrShell
This class represents a triangulated solid or shell.
Remarks:
The triangulation consists of a number of TriangulatedShellComponents.
For a solid, there will be one TriangulatedShellComponent for each component
of the solid's boundary. For example, a solid cube has just one boundary component
(containing six faces), so there will be just one TriangulatedShellComponent. A solid
consisting of two disjoint cubes has two boundary components (the boundaries of the
two cubes), so there will be two TriangulatedShellComponents. A solid consisting of a
sphere with a round void (or hole) inside it also has two boundary components (the
outer sphere and the inner sphere), so there will be two TriangulatedShellComponents.
For a shell, there will be one TriangulatedShellComponent for each component of
the shell.
Note that this class does not contain information on the containment structure
of the boundary components of a solid.
Be careful not to confuse the components of a solid with the solid's
boundary components. This class deals only with the boundary components.
Since:
2013